algorithms_clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-07 Sat 00:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用Clojure实现的一些算法</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">使用Clojure实现的一些算法</h1>
<p>
<a href="./index.html">回到首页</a>
</p>

<div id="outline-container-org6884555" class="outline-2">
<h2 id="org6884555"><span class="section-number-2">1</span> 排序 Selection Sort</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-clojure">(defn selection-sort [list1]

  (let [t1 (transient list1) minIdx (atom 0) tempVal (atom nil)]
    (doseq [idx1 (range 0 (count list1))]
      (reset! minIdx idx1)
      (doseq [idx2 (range (inc idx1) (count list1))]
	(when (&gt; (compare (get t1 @minIdx) (get t1 idx2)) 0)
	  (reset! minIdx idx2) )
	)
      (when (not (= @minIdx idx1))  ;; Exchange values
	(reset! tempVal (get t1 idx1))
	(assoc! t1 idx1 (get t1 @minIdx))
	(assoc! t1 @minIdx @tempVal) )

      )
    (persistent! t1) ) )
</pre>
</div>
</div>
</div>

<div id="outline-container-org11f43cc" class="outline-2">
<h2 id="org11f43cc"><span class="section-number-2">2</span> 二分查找 Binary Search</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-clojure">(defn binary-search [coll item]

  (let [midAm (atom 0)
	loAm (atom 0) hiAm (atom (dec (count coll))) resultAm (atom nil) val1 item]
    (while (and (&lt;= @loAm @hiAm) (nil? @resultAm))
      (reset! midAm (+ (int (/ (- @hiAm @loAm) 2)) @loAm))
      (if (= (compare val1 (get coll @midAm)) 0)
	(do (reset! resultAm @midAm))
	(if (&gt; (compare val1 (get coll @midAm)) 0)
	  (do (reset! loAm (inc @midAm)))
	  (do (reset! hiAm (dec @midAm))) )
	)
      )
    @midAm )
  )
</pre>
</div>
</div>
</div>


<div id="outline-container-org1b6a5cb" class="outline-2">
<h2 id="org1b6a5cb"><span class="section-number-2">3</span> 红黑树相关 Red-Black Tree</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-clojure">(def RED true)
(def BLACK false)
(defrecord RBNode [key val nodeNumAm colorAm leftAm rightAm])


(defn rbtree-node-size [node]
  "Calculate tree size/tree weight."
  (let [cntAm (atom 0)]
    (defn -count-node-size [n]
      (when-not (or (nil? (:leftAm n)) (nil? @(:leftAm n)))
	(reset! cntAm (inc @cntAm))
	(-count-node-size @(:leftAm n)) )
      (when-not (or (nil? (:rightAm n)) (nil? @(:rightAm n)))
	(reset! cntAm (inc @cntAm))
	(-count-node-size @(:rightAm n)) ) )
    (-count-node-size node)
    (when-not (nil? node) (reset! cntAm (inc @cntAm)))
    (deref cntAm) ) )

(defn rbtree-rotate-right [node]
  "Rotate right."
  (let [x @(:leftAm node)]
    (reset! (:leftAm node) @(:right x))
    (reset! (:rightAm x) node)
    (reset! (:colorAm x) @(:colorAm node))
    (reset! (:colorAm node) RED)
    (reset! (:nodeNumAm x) @(:nodeNumAm node))
    (reset! (:nodeNumAm h) (+ 1 (rbtree-node-size @(:leftAm node))
			      (rbtree-node-size @(:rightAm node))))
    x ) )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf012922" class="outline-2">
<h2 id="orgf012922"><span class="section-number-2">4</span> 最短路径 Shortest Path</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-clojure">
;; 测试参数
;;(def paths [[:A :B 1] [:A :F 1]
;;              [:B :C 2] [:B :F 2]
;;              [:C :D 3] [:C :F 1]
;;              [:D :E 4]
;;              [:F :G 10]
;;              [:E :Z 5]
;;              [:G :Z 11]])


(defrecord ShortPath [from to lenAm prevAm])

(defn shortest-path [paths]

  (let [PathList (transient [])]

    (defn -merge-path [shortPath]
      (let [ifMatchedAm (atom false)]
	(doseq [pathItemIdx (range 0 (count PathList))]
	  (let [pathItem (get PathList pathItemIdx)]

	    (when (and (= (:from pathItem) (:from shortPath))
		       (= (:to pathItem) (:to shortPath)))

	      (reset! ifMatchedAm true)

	      (let [pathLen @(:lenAm pathItem) newLen @(:lenAm shortPath)]
		(when (or (nil? pathLen) (&gt; pathLen newLen))
		  (reset! (:lenAm pathItem) newLen)
		  (reset! (:prevAm pathItem) @(:prevAm shortPath)) ) ) ) ) )
	(when-not @ifMatchedAm
	  (conj! PathList shortPath) ) ) )


    (doseq [path paths]

      (let [newPath (-&gt;ShortPath (nth path 0)
				 (nth path 1)
				 (atom (nth path 2))
				 (atom nil))]
	(conj! PathList newPath)

	(let [mergeList (transient [])]
	  (doseq [pathItemIdx (range 0 (count PathList))]
	    (let [pathItem (get PathList pathItemIdx)]
	      (when (= (:to pathItem) (nth path 0))
		(conj! mergeList (-&gt;ShortPath (:from pathItem)
					      (nth path 1)
					      (atom (+ @(:lenAm pathItem)
						       (nth path 2)))
					      (atom (:to pathItem)))) ) ) )
	  (doseq [mergeItem (persistent! mergeList)]
	    (-merge-path mergeItem) ) ) ) )

    (persistent! PathList) ) )
</pre>
</div>
</div>
</div>


<div id="outline-container-orga9c312e" class="outline-2">
<h2 id="orga9c312e"><span class="section-number-2">5</span> 三重排序 Three-way string quicksort</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-clojure">(defn threeway-sort [strCol]
  (defn -sort1 [strArr lo hi charIdx]
    (when (&lt; lo hi)
      (let [ltAm (atom lo) gtAm (atom hi)
	    vAm (atom (get (get strArr lo) charIdx)) iAm (atom (inc lo))]
	;;
	(while (&lt;= @iAm @gtAm)
	  (let [t (get (get strArr @iAm) charIdx)]
	    (if (&lt; (int t) (int @vAm))
	      (do
		(let [tmp (get strArr @ltAm)]
		  (assoc! strArr @ltAm (get strArr @iAm))
		  (assoc! strArr @iAm tmp))
		(swap! ltAm inc)
		(swap! iAm inc) )

	      (if (&gt; (int t) (int @vAm))
		(do
		  (let [tmp (get strArr @iAm)]
		    (assoc! strArr @iAm (get strArr @gtAm))
		    (assoc! strArr @gtAm tmp))
		  (swap! gtAm dec) )
		(swap! iAm inc) )
	      )
	    )
	  )

	(-sort1 strArr lo (dec @ltAm) charIdx)
	(when (&gt; (int @vAm) 0) (-sort1 strArr @ltAm @gtAm (inc charIdx)))
	(-sort1 strArr (inc @gtAm) hi charIdx) ) ) )

  (let [strArr (transient strCol)]
    (-sort1 strArr 0 (dec (count strCol)) 0)
    (persistent! strArr) ) )


(-&gt;
  (threeway-sort ["abcde" "zab" "back"])
  (println))
</pre>
</div>



<p>
<a href="./index.html">回到首页</a>
</p>
</div>
</div>
</div>
</body>
</html>
